solarBeamWithTreesChu4/system/solid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {	
	name glass;
	patchInfo
	{
	type mappedPatch;
	        sampleMode      nearestPatchFace;
	}
	constructFrom set;
	set glass;
    }
	
    {	
	name walls;
	patchInfo
	{
	type mappedPatch;
	        sampleMode      nearestPatchFace;
	}
	constructFrom set;
	set walls;
    }
	
    {	
	name floor1;
	patchInfo
	{
	type mappedPatch;
	        sampleMode      nearestPatchFace;
	}
	constructFrom set;
	set floor1;
    }
);


// ************************************************************************* //
