solarBeamWithTreesChu4/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//并行节点数
numberOfSubdomains  4;

method          scotch;

coeffs
{
    n           (2 2 1);//计算域按照x、y、z方向被切分，x方向2块、y方向2块，z反向1块
}

scotchCoeffs
{
}

// ************************************************************************* //
