solarBeamWithTreesChu4/system/solid/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    //glass
    {
        name    glass;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (16   16  9)(24  24  9);
    }

    // walls
    {
        name    walls;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (15   15 1)(25  15  9);

    }
    {
        name    walls;
        type    faceSet;
        action  add;
        source  boxToFace;

        box     (25   15  1)(25  25  9);
    }
    {
        name    walls;
        type    faceSet;
        action  add;
        source  boxToFace;
        box     (15   15  1)(15 25  9);
    }
    {
        name    walls;
        type    faceSet;
        action  add;
        source  boxToFace;
        box     (15   25  1)(25  25  9);
    }
//floor
    {
        name    floor1;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (16   16  1)(24  24  1);
    }

);

// ************************************************************************* //
